Repository: grystyle/OAWeather
Catalog: po/*.po
Languages: fi

source: %d Minutes
fi: %d minuuttia

source: Add
fi: Lisää

source: Cache data
fi: Välimuisti

source: Choose the icon set. You need to create an additional set here: /usr/share/enigma2/WeatherIconSets/NAME.
fi: Valitse ikonisarja. Sinun on luotava lisäsetti tähän: /usr/share/enigma2/WeatherIconSets/NAME.

source: Choose whether the 'night switch' should be activated or not. Some icons are then displayed as night icons with moon.
fi: Valitse, otetaanko 'yökytkin' käyttöön vai ei. Jotkut ikonit näytetään sitten yöikoneina kuun kanssa.

source: Show trend arrows for moon data
fi: Näytä trendinuolet kuutiedoille

source: Show trend arrows for moon illumination and moon distance to see the current trend of the data.
fi: Näytä kuun valaistuksen ja kuun etäisyyden trendinuolet nähdäksesi nykyisen datan trendin.

source: Chose favorite
fi: Valitse suosikki

source: City '%s' not found! Please try another wording.
fi: Kaupunkia '%s' ei löydy! Kokeile toista sanamuotoa.

source: Current Weather
fi: Tämänhetkinen sää

source: Default
fi: Oletus

source: Defaults
fi: Oletukset

source: Delete
fi: Poista

source: Disabled
fi: Pois käytöstä

source: Do you really want do delete favorite '%s'?
fi: Haluatko poistaa suosikin '%s'?

source: Do you really want do exit without saving your modified favorite list?
fi: Haluatko poistua tallentamatta muokattua suosikkilistaa?

source: East
fi: Idästä

source: Edit
fi: Muokkaa

source: Enable Debug
fi: Ota Debug käyttöön

source: Enabled
fi: Käytössä

source: Enter the location for your weather forecasts. To include your location, expand your favorites list with 'Manage your favorites'.
fi: Anna sijainti sääennusteille. Jos haluat sisällyttää sijaintisi, laajenna suosikkiluetteloasi valitsemalla 'Hallinnoi suosikkejasi'.

source: Error getting City ID
fi: Virhe haettaessa kaupunkitunnusta

source: Error in Weatherinfo
fi: Virhe säätiedoissa

source: More Details / Smaller font
fi: Enemmän yksityiskohtia / Pienempi fontti

source: Less details / Larger font
fi: Vähemmän yksityiskohtia / Suurempi fontti

source: Favorites have been successfully saved!
fi: Suosikit tallennettu onnistuneesti!

source: Feels like
fi: Tuntuu kuin

source: Humidity
fi: Kosteus

source: MSN weather
fi: MSN sää

source: Manage favorites
fi: Hallinnoi suosikkeja

source: Metric unit for wind speed
fi: Tuulen nopeuden yksikkö metrijärjestelmässä

source: Next favorite
fi: Seuraava suosikki

source: View details
fi: Katso tiedot

source: Day +/-
fi: Päivä +/-

source: Details +/-
fi: Yksityiskohdat +/-

source: Settings
fi: Asetukset

source: Glass
fi: Lasi

source: Manage your favorites
fi: Hallinnoi suosikkejasi

source: No data available for this period.
fi: Tietoja ei ole saatavilla tälle ajanjaksolle.

source: No data available.
fi: Tietoja ei ole saatavilla.

source: North
fi: Pohjoisesta

source: Northeast
fi: Koillisesta

source: Northwest
fi: Luoteesta

source: Open-Meteo Wetter
fi: Open-Meteo Sää

source: Precipitation
fi: Sateen tod.näköisyys

source: Previous favorite
fi: Edellinen suosikki

source: Refresh interval
fi: Päivitysväli

source: Save
fi: Tallenna

source: Search for your city
fi: Etsii kaupunkiasi

source: Select 'Yes' to enable add debug output to log.
fi: Valitse 'Kyllä', jos haluat lisätä tapahtumat debug-lokiin.

source: Select 'Yes' to enable the addition of Weather.
fi: Valitse 'Kyllä' ottaaksesi sään lisäyksen käyttöön.

source: Select desired location
fi: Valitse haluamasi sijainti

source: Select the metric unit for wind speed to be used for wind displays. This has no effect on the imperial unit 'mph'.
fi: Valitse tuulennopeuden metrijärjestelmän yksikkö tuulinäyttöjä varten. Tämä ei vaikuta imperiaaliseen yksikköön 'mph'.

source: Select the preferred weather service to supply the weather information.
fi: Valitse haluamasi sääpalvelun toimittamat säätiedot.

source: Select the temperature unit to be used for temperature displays.
fi: Valitse lämpötilan näytöissä käytettävä lämpötilayksikkö.

source: Select the detail level in the detail view. You have the choice between a comprehensive presentation in a smaller font and a reduced presentation with a larger font.
fi: Valitse yksityiskohtataso tiedot-näkymästä. Voit valita kattavan esityksen pienemmällä fontilla tai supistetun esityksen suuremmalla fontilla.

source: Select this option to save that last obtained weather data locally. This is used to initialize the data immediately after restart while updated data is being fetched.
fi: Valitse tämä vaihtoehto tallentaaksesi viimeksi hankitut säätiedot paikallisesti. Tätä käytetään tietojen alustamiseen välittömästi uudelleenkäynnistyksen jälkeen, kun päivitettyjä tietoja haetaan.

source: Select your location
fi: Valitse sijaintisi

source: Set default values
fi: Aseta oletusarvot

source: Show Weather Forecast
fi: Näytä sääennuste

source: South
fi: Etelästä

source: Southeast
fi: Kaakosta

source: Southwest
fi: Lounaasta

source: Specify how often Weather retrieves its data from the server. 'Once' means the data will loaded only once after a GUI or system start.
fi: Määritä, kuinka usein Sää hakee tietonsa palvelimelta. 'Kerran' tarkoittaa, että tiedot ladataan vain kerran graafisen käyttöliittymän tai järjestelmän käynnistyksen jälkeen.

source: Temperature unit
fi: Lämpötilayksikkö

source: Detail level in detail view
fi: Yksityiskohtataso tiedot-näkymässä

source: The city name is too short. More than 2 characters are needed for search.
fi: Kaupungin nimi on liian lyhyt. Hakuun tarvitaan enemmän kuin 2 merkkiä.

source: The favorite '%s' corresponds to the set weather city name and therefore cannot be deleted.
fi: Suosikki '%s' vastaa asetettua sääkaupungin nimeä ja siksisitä ei voi poistaa.

source: Today
fi: Tänään

source: Update
fi: Päivitetty

source: Weather Plugin
fi: Sää-lisäosa

source: Weather Plugin Detailview
fi: Sää-lisäosan yksityiskohtainen näkymä

source: Weather Plugin Overview
fi: Sää-lisäosan yleiskatsaus

source: Weather Settings Actions
fi: Sääasetuksien toiminnot

source: Weather city name
fi: Sää-kaupungin nimi

source: Weather cityname (at least 3 letters):
fi: Sää-kaupungin nimi (vähintään 3 kirjainta):

source: Weather icon night switch
fi: Sääikonin yökytkin

source: Weather icon set
fi: Sääikonisetti

source: Weather service
fi: Sääpalvelu

source: Weather API key v2.5
fi: Sää API -avain v2.5

source: Weather settings
fi: Sääasetukset

source: West
fi: Lännestä
